Repository: mozilla-l10n/mt-training-data
Catalog: hus/hus_pontoon.tmx
Source language: en_us
Languages: hus

source: Account picture
hus: A wál k'ot'bilabil

source: Complete set-up by entering the new password on your other Firefox devices.
hus: Abal ka ejtow ka tala' t'ojojoy ka punuw a it tsinat japixtal al patal a pat'ál eyendhanelil

source: Display name
hus: An bijláb axi a le' ka olna'

source: Email address
hus: a bukúl káwil (correo electrónico)

source: Firefox Sync will resume momentarily
hus: Firefox Sync ne ka t'ojonits (ka aychij we')

source: Password reset
hus: Ts'ejkan juníl an tsinat japixtaláb

source: Password reset successfully. Sign in to continue.
hus: An tsinat japixtaláb ts'ejkáj juníl. Ka uliw jit'a' játs tatá' abal ka awits kit otsits.

source: %(permissionName)s (required)
hus: %(permissionName)s (In yejenchal)

source: Sign in
hus: Kit otsits.

source: Use the code %(code)s to set up two-step authentication in supported applications.
hus: Ka eyendha' an japixtaláb %(code)s abal kit otsits (axé' játs abal ka k'aniy a k'al) al an eyendhanél axi in batsúwal.

source: Welcome back
hus: Alwa'ultaláb abal tatá'

source: Your password has been reset
hus: xo' a kwa'alits jún a it tsinat japixtal

source: Could not add email address to database.
hus: Yab u awil ka punwat an correo electrónico al an Base de datos.

source: Could not load breaches.
hus: Yab awits ki tejwa'medha' an filtraciones.

source: Error connecting to { -brand-HIBP }.
hus: Yab i ejtow ki punchiy k'al { -brand-HIBP }

source: Firefox Private Network
hus: Red privada de Firefox

source: Terms & Privacy
hus: Axi u awil ani yab u awil ka t'aja'

source: This email address is not subscribed to { -product-name }.
hus: Axi correo electrónico yab u eyendháb ti { -product-name }

source: Too many connections to { -brand-HIBP }.
hus: Tekedh yán ti eyadh an { -brand-HIBP }.

source: You must be signed in to your { -brand-fxa }.
hus: Ka japiy a k'al ti { -brand-fxa }

source: You tried to scan too many email addresses in a short time period. For security reasons, we’ve temporarily blocked you from new searches. You’ll be able to try again later.
hus: A exa' ka aliy tekedh yán i correo electrónico al jun i k'ij lej tsipkats. Jaxtam i mapuy an alimtaláb, talbél ne'ets ka awits ka eyendha'.

source: %1$d out of %2$d
hus: %1$d in k'al %2$d

source: %1$s also uses blocklists provided by Disconnect, Inc. as separate and independent works under the <a href="%2$s">GNU General Public License v3</a>, and available <a href="%3$s">here</a>.
hus: %1$s aniyej in eyendhal an kawchik abal ka kuba' xi in k'al Disconnect, Inc. axe' pilchik i t'ojláb ani <a href="%2$s"> Japidh abal ka eyan GNU v3</a>, axi u awil ka ela' <a href="%3$s">te'</a>.

source: %1$s finished
hus: %1$s talbedhamej

source: %1$s is free and open source software made by Mozilla and other contributors.
hus: %1$s pel jún i eyendhanél japidh, ts'ejkadh k'al Mozilla ani k'al pilchik i junkudh t'ojnal.

source: %1$s is made available to you under the terms of the <a href="%2$s">Mozilla Public License</a> and other open source licenses.
hus: %1$s k'wajat ts'ejkadh k'al in kawintal an <a href="%2$s"> japidh jiladh káw in k'al Mozilla </a> ani pil i japidh eynal káw.

source: %1$s will send what you type in the address bar to your search engine
hus: %1$s ne'ets kin abna' patal axi a dhuchál ti al an alimtaláb

source: About
hus: Tin kwenta an

source: About %1$s
hus: Tin kwentaj an %1$s

source: About %1$s, help
hus: Tin kwentaj %1$s, tolmixtaláb

source: Add
hus: Ka punuw

source: Add and manage custom autocomplete URLs.
hus: Ka punuw ani ka t'ojojoy an kwetém kidhbax URL.

source: + Add another search engine
hus: + Ka punuw pil i alim

source: + Add custom URL
hus: + Ka punuw an URL axi tsab bijidh

source: Add custom URL
hus: Ka punuw an URL axi tsab bijidh

source: Additional source code for %1$s is available under various other free and open source <a href="%2$s">licenses</a>.
hus: Pilchik i <a href="%2$s"> dhuchlab </a> axi japidh ani ts'ejwalidh aniyej in ko'oyal jant'ini' ti ts'ejkadh abal %1$s.

source: Add search engine
hus: Ka punuw an alim

source: Add shortcuts to your home screen
hus: Ka punuw tin ok'ox wal a pat'alil, an bél xi kin taja' kit ulits dhubat

source: Add to Home screen
hus: Ka punuw al an ok'ox xeklek

source: Advanced
hus: Axi lej ebál in tsap

source: An installed search engine is already using that name.
hus: Jun i alim in kwa'alits jayetsej nix'e' xi bijláb

source: Authentication required
hus: I yejenchal kit otsits

source: Autocomplete
hus: Ka kwetém kidhban

source: Autocomplete URLs for sites you use most Long-press any URL in the address bar
hus: Ka eyendha' an kweten putundhach URLs abal an xeklek axi a eyendal Ka ni'a' jawakits tum URLs ti alimtaláb

source: Automatic private browsing. Browse. Erase. Repeat.
hus: Eyendhanél abal kit almáts tsinat. Kit almáts. Ka pakuw. Ka tsab t'aja'.

source: Block 3rd-party cookies only
hus: Ka kuba' an cookies xi in k'al pil jita'

source: Block 3rd-party tracker cookies only
hus: Ka kuba' an cookies xi in k'al pil jita'

source: Block ad trackers
hus: Yab ka jila' kit olchin axi nujuwáb

source: Block analytic trackers
hus: Ka kuba' an alim axi u tsalpax

source: Block cookies
hus: Ka kuba' an cookies

source: Block JavaScript
hus: Ka kuba' an JavaScript

source: Block other content trackers
hus: Ka kuba' an alim xi in aliyal jant'o in kwa'al an xeklek

source: Block social trackers
hus: Ka kuba' an alim in k'al an buk'ul káwchik

source: Block trackers
hus: Ka kuba' an alimchik

source: Block Web fonts
hus: Ka kuba' an fuentes xi ti xeklek

source: Cancel
hus: Ka kuba'

source: Check that search string matches Example format
hus: Ka t'aja' ti kwentaj max axi a le' ka dhucha' ejtil an t'iplab

source: Clear
hus: Ka k'wit'iy

source: Clear input
hus: Ka pakuw axi a dhuchamal

source: Cookies and Site Data
hus: Cookies ani xi dhuchadh ti xeklek

source: Copy image address
hus: Ka buk'uw in ts'ajil an k'otbiláb

source: Copy link address
hus: Ka k'ot'biy an ts'aj

source: Custom URLs
hus: Ka tsab bijiy an URLs

source: Data Choices
hus: Eyendhanel tin kwentaj an xeklek

source: Data Collection & Use
hus: Axi in penál a k'al ani jant'ini' tu eynal

source: Default
hus: Axi punudh ok'ox

source: Default browser, tabs, language
hus: Ok'ox eyendhanél, xeklek, káwintal

source: Default URL List
hus: kwene' i URL axi ok'ox dhuchadh

source: Developer tools
hus: Eyendhanél abal an ts'ejkom

source: Dismiss
hus: Yab ka t'aja' ti kwentaj

source: Dismiss find in page
hus: Ka mapuy an alim

source: Double-check the URL you entered.
hus: Ka dhucha' juníl an URL axi a dhucha'its ok'ox.

source: Download
hus: Ka pa'ba'

source: Downloaded files <b>will not be deleted</b> when you erase %1$s history.
hus: Axi a pa'ba' <b>yab ne'ets ka pakuwat</b> tam ka pakuw an dhuchlab axi in ulal jawa' a tsa'biyamal %1$s.

source: Download File
hus: Ka pa'ba'

source: Download Firefox
hus: Ka pa'ba' Firefox

source: Embedded on sites to track your visits and to display functionality like share buttons
hus: Punudh al an xeklek abal ka exláj jawa' a tsa'biyamal ani in tejwa'medhal ejtil an ni'omtaláb ka buk'uw

source: Enable to autocomplete more than 450 popular URLs in the address bar.
hus: ka lek'wtsiy abal kin kwetém kidhbay 450 i URLs abal ebál, axi lej exladh, ti jolataláb ju'taj it alim.

source: Enable to have %1$s autocomplete over 450 popular URLs in the address bar.
hus: ka lek'wtsiy abal %1$s kin kwetém kidhbay 450 i URLs abal ebál, axi lej exladh, ti jolataláb ju'taj it alim.

source: Enabling may cause some pages to behave unexpectedly
hus: Max ka lek'wtsiy, wa'ats i xeklek axi yab ne'ets ka alwa' tejwa'mej

source: Enter search engine name
hus: Ka dhucha' in bij an it alim

source: Enter search string
hus: Ka punuw axi ne'ets ka aliy

source: Erase
hus: Ka pakuw

source: Erase and Open
hus: Ka pakuw ani ka japiy

source: Erase and open %1$s
hus: Ka pakuw ani ka japiy %1$s

source: Erase browsing history
hus: Ka pakuw an dhuchlab xi in olnál jant'oj a aliyamal

source: Example: example.com
hus: Ejtil: example.com

source: Example: example.com/search/?q=%s
hus: Ejtil: example.com/search/?q=%s

source: Example: mozilla.org
hus: Ejtil: mozilla.org

source: Exit Private Browsing?
hus: ¿A le' kit kalej ti tsinat tsa'bixtaláb?

source: Find an app that can open link
hus: Ka aliy jun i eyendhanel axi kin ejtow kin japiy

source: Find in page
hus: Ka aliy al an xeklek

source: Find in Page
hus: Ka aliy al an xeklek

source: Find next result
hus: Ka met'a' axi ne'ets ka tejwa'mej talbél

source: Find previous result
hus: Ka met'a' axoi kalej ok'ox

source: Finger moved too fast. Try again.
hus: A ch'uchub ejláts tekedh adhik. Ka exa' juníl.

source: Fingerprint icon
hus: T'ipodhtaláb in k'al a ch'uchub

source: Fingerprint not recognized. Try again.
hus: In t'iplabil a ch'uchub yab exláj. Ka exa' juníl

source: General
hus: Tin patál

source: Get one-tap access to sites you use most%1$s Menu > Add to Home screen
hus: Ka ela' k'al jun i takaxtaláb an xeklek axi a lej eyendhál%1$s Takuxtaláb> Ka punuw ti ok'ox xeklek

source: Get one-tap access to sites you use most Menu > Add to Home screen
hus: Ka ela' k'al jun i takaxtaláb an xeklek axi a lej eyendhál Takuxtaláb> Ka punuw ti ok'ox xeklek

source: Get search suggestions
hus: Ti ucha' jant'oj axi a le' ka aliy

source: Help
hus: Tolmixtaláb

source: Hide webpages when switching apps and block taking screenshots.
hus: Ka tsina' an xeklek tam k'wajat a jalk'uyal an eyendhanél.

source: Insecure Connection
hus: Palat po yab beletnadh

source: Installed search engines
hus: An alimchik punudhits ta k'al

source: Language
hus: Káwintaláb

source: Learn more
hus: Ka exla' más

source: Loading
hus: K'wajat ti t'uchel

source: Make %1$s default browser
hus: Ka t'aja' %1$s ta eyendhanelil

source: Make privacy a habit
hus: Kit xe'tsin k'al an tsinataláb

source: May result in missing icons or images
hus: U awil ka k'ibej anwalekláb ani an k'ot'biláb

source: More options
hus: Eyendhanélchik

source: Mozilla strives to collect only what we need to provide and improve %1$s for everyone.
hus: Mozilla in t'ajál abal kin pena' expidh xi in yejenchal ani kin alwa'medha' %1$s abal patal.

source: Navigate back
hus: Kit wichiy ju'taj a tsa'biyamalits

source: Navigate forward
hus: Kit k'alej abal ok'ox

source: New custom URL added.
hus: It URL axi it bijidh, punudh.

source: New search engine added.
hus: Punuwat jun i it alim

source: New Session
hus: It eyendhanél

source: Next
hus: Xi tal

source: No
hus: Ibaj

source: None of the apps on your device are able to open this link. You can leave %1$s to search %2$s for an app that can.
hus: Ma ni jun i eyendhanél axi in kwa'al a pat'alil in jetowal kin japiy. U awil kit kalej ti %1$s abal ka aliy pil i eyendhanél abal %2$s.

source: Notifications let you erase your %1$s session with a tap. You don’t need to open the app or see what’s running in your browser.
hus: An tejwa'medhomtaláb in jilál ka pakuw an t'ojláb xi %1$s k'al jún i takixtaláb. Yab in yejendhal ka japiy an eyendhanél o ka met'a' max k'waja ti t'ojnal al an tsa'bixtaláb.

source: Number of trackers blocked
hus: Jáy i alim kubadh

source: Off
hus: Ka tepdha'

source: OK
hus: Ka bats'uw

source: OK, got it!
hus: ¡U ejtiyal!

source: On
hus: Ka lek'wtsiy

source: Oops
hus: Ups

source: Open
hus: Ka japiy

source: Open a link in a new tab Long-press any link on a page
hus: Ka japiy jun i ne'dhach al jun i it xeklek Ka jila' ni'adh jawakitsk'ij tum ne'dhach al jun i xeklek

source: Open every link in %1$s Set %1$s as default browser
hus: Ka japiy patal an ne'dhom %1$s Ka t'aja' %1$s ta ok'ox eyendhom

source: Open in…
hus: Ka japiy ti…

source: Open in %1$s
hus: Ka japiy ti %1$s

source: Open link in another app
hus: Ka japiy al pil i eyendhanél

source: Open link in new tab
hus: Ka japiy an ts'aj al pil i xeklek

source: <p>%1$s puts you in control.</p> <p>Use it as a private browser: <ul> <li>Search and browse right in the app</li> <li>Block trackers (or update settings to allow trackers)</li> <li>Erase to delete cookies as well as search and browsing history</li> </ul> </p> <p>%1$s is produced by Mozilla. Our mission is to foster a healthy, open Internet.<br/> <a href="%2$s">Learn more</a></p>
hus: <p>%1$s ti pidhál a awiltal.</p> <p>Ka eyendha' an eyendhanél abal kit tsinat tsa'bixin: <ul> <li>Ka aliy ani ka tsa'biy an xeklek, ti eyendhanél</li> <li>Ka mapchij in belil an alim (o ka t'ojojoy max a le' ka jila' ka otsits)</li> <li>Ka pakuw abal ka tixk'a' an tsakam tsi'madh bok'ól ani patal axi a aliyamal ani a tsa'biyamal</li> </ul> </p> <p>%1$s ts'ejkadh k'al Mozilla. I le' abal ka wa'tsin jun i ebtsolóm lubach ani japidh.<br/> <a href="%2$s">Xa exla'yej</a></p>

source: Pages may load faster, but may also behave unexpectedly
hus: An xeklek u awil ka dhubath tejwa'mej, poj u awil yab ka tejwa'mej alwa'

source: Password
hus: Tsinat japixtal

source: Paste or enter URL
hus: Ka ts'ata' o ka dhucha' an URL

source: Performance
hus: Alwa'taláb

source: Powered by %1$s
hus: Tolmidh k'al %1$s

source: Power up your privacy
hus: Ka k'adhbanchij in tsapik an tsinataláb

source: Privacy
hus: Tsinataláb

source: Privacy Notice
hus: Tin kwentaj an tsinaxtaláb

source: Privacy & Security
hus: Tsinataláb ani belkadhtaláb

source: Private browsing session
hus: Axe' an tsa'bixtaláb tsinat

source: Problem loading page
hus: Yab u awil ka tejwa'mej an xeklek

source: Rather see the full desktop site?%1$s Menu > Request desktop site
hus: A le' ka meta' an xeklek ta mexajil%1$s Takuxtaláb > Ka konoy an xeklek ta mexajil

source: Rather see the full desktop site? Menu > Request desktop site
hus: A le' ka meta' an xeklek ta mexajil Takuxtaláb>Ka konoy an xeklek ta mexajil

source: Reload website
hus: Ka tsab pa'baj an xeklek

source: Remote debugging via USB/Wi-Fi
hus: An kw'it'ixtaláb ma ti USB/Wi-Fi

source: Remove
hus: Ka pakuw

source: Remove custom URLs
hus: Ka pakuw an URL axi tsa bijidh

source: Remove search engines
hus: Ka pakuw an alimchik

source: Report Site Issue
hus: Ka olna' max wa'ats jún i odheltaláb al an xeklek

source: Request desktop site
hus: Ka konoy abal ka eyendha' ta mexajil

source: Restore default search engines
hus: Ka punuw juníl an alimchik axi talakits ok'chidh

source: Return to previous app
hus: Kit wichiy al xi jún an eyendhanél

source: Return to your favorite sites in %1$s quickly. Just select "Add to Home screen" from the %1$s menu.
hus: Kit wichiy dhubat al an xeklek xi a kulbetnál ti %1$s. Ka takuy "Ka punuw ti ok'ox xeklek" o ti %1$s.

source: Save
hus: Ka dheya'

source: Saved and shared images <b>will not be deleted</b> when you erase %1$s history.
hus: An k'ot'biláb axi a dheyamal, ani axi a buk'umal <b>yab ne'ets ka pakuwat</b> tam ka pakuw an dhuchlab axi in ulal jawa' a tsa'biyamal %1$s.

source: Save image
hus: Ka dheya' an k'ot'biláb

source: Search
hus: Ka aliy

source: Search engine name
hus: In bij an alim

source: Search for %1$s
hus: Ka aliy %1$s

source: Searching for something different? Choose another default search engine in Settings.
hus: ¿A aliyal jant'oj pil? Ka t'ojojoy pil i alim.

source: Search or enter address
hus: Ka dhucha' axi a le' ka aliy

source: Search Privately
hus: Kit alim tsinat

source: Search string to use
hus: Ka aliy an kawchik axi eynal

source: Secure connection
hus: Paladh alwa' ani k'anidh

source: Secure Connection
hus: Palat beletnadh

source: Secure connection failed
hus: Yab awíts ka palan k'anidh

source: Security
hus: k'anidhtaláb

source: Send usage data
hus: Ka ebna' jay i eyendhanél a eyendhamal

source: Server not found
hus: Yab elan an pat'ál ju'taj dheyach an xeklek

source: Set %1$s as your default browser and get the benefits of private browsing when you open webpages from other apps.
hus: Ka t'aja' abal %1$s ka wenk'on ta alimtal ani ka ko'oy an alwa'taláb abal kit tsa'bixin tsinat tam ka japiy jun i xeklek al pil i eyendhanél.

source: Set default, autocomplete
hus: An eyendhanél axi a takuyamal, kwetem kidhbax

source: Settings
hus: Ka t'ojojoy

source: Share…
hus: Ka buk'uw…

source: Share image
hus: Ka buk'uw an k'ot'biláb

source: Share link
hus: Ka buk'uw an ts'aj

source: Share via
hus: Ka buk'uw ti

source: Shortcut will open with Tracking Protection disabled
hus: An dhubat bél ne'ets ka japin yab k'anidh

source: Site behaving unexpectedly? Try turning off Tracking Protection
hus: An xeklek yab u alwa' t'ojnal Ka exa' ka kuba' an k'anix abal yab kit kedhmayat

source: Site Security
hus: In k'anix an xeklekchik

source: Skip
hus: Yab ka t'aja' ti kwentaj

source: Some ads track site visits, even if you don’t click the ads
hus: Wa'ats axi in olnál an nujnél, ani in tsu'tal jant'oj a met'al al an xeklek axi a tsa'biyal, aba' ij ka ni'a' eblim al an olchixtaláb

source: Some search engines cannot show suggestions.
hus: Wa'ats i alimtaláb axi yab in olnál jant'oj u awil ka aliy.

source: Stealth
hus: Yab tejwa'

source: Stop loading website
hus: Ka jila' ka pa'iy an xeklek

source: Switching Apps
hus: Jalk'unal an eyendhanél

source: Switch to link in new tab immediately
hus: Ka japiy al jún i it xeklek

source: System default
hus: Jant'ini' ok'ox punudh an sistema

source: Tab’s browsing history has been erased.
hus: Pakuwatits an dhuchlab xi in olnál jant'oj a aliyamal.

source: Tabs open: %1$s
hus: Xeklekchik xi japidh: %1$s

source: Take private browsing to the next level. Block ads and other content that can track you across sites and bog down page load times.
hus: Ka ne'dha' ebál an tsinat tsa'bixtaláb. Ka kuba' an olnom ani pilchik i tejwa'medhomtaláb axi u awil ti tsinat met'a' al an xeklek, ani kin t'aja' abal an xeklekchik yab ka dhubat tejwa'mej.

source: The address isn’t valid
hus: An dhuchlab yab alwa'

source: The address wasn’t understood
hus: Yab u exbayáb an dhuchlab

source: The connection timed out
hus: An k'ij abal ka awits kit paley, taliy

source: The page isn’t redirecting properly
hus: An xeklek yab k'wajat ti elnal jant'ini' in tomnál

source: To get search suggestions, %1$s needs to send what you type in the address bar to the search engine you’ve chosen. %2$s.
hus: Abal kit olchin jant'oj ka aliy, %1$s a yejenchal ka abna' axi a dhuchál ti eyendhaxtaláb abal kit almáts %2$s.

source: Touch the fingerprint sensor to continue.
hus: Ka taka' an ajum k'ot'bil ch'uchub abal kit otsits.

source: Trackers blocked
hus: Ka mapchij in belil an alim

source: Tracking, cookies, data choices
hus: Alim, cookies, a k'al

source: Tracking Protection
hus: K'anix abal yab ka exláj jant'oj a aliyamal

source: Try Again
hus: Ka exa' juníl

source: Turn off tips on the %1$s start screen
hus: Ka tepdha' an kawchix axi ti olchal ti ok'ox xeklek ti %1$s

source: Turn off tips on the start screen
hus: Ka tepdha' an kawchix axi ti olchal ti ok'ox xeklek

source: <ul> <li>Check the address for typing errors such as <strong>ww</strong>.example.com instead of <strong>www</strong>.example.com</li> <li>If you are unable to load any pages, check your device’s data or Wi-Fi connection.</li> </ul>
hus: <ul> <li>Ka met'a' abal an dhuchlab alwa' dhuchadh, yab ejtil <strong>ww</strong>.example.com ani yab ejtil <strong>www</strong>.example.com</li> <li>Max yab u awil ka tsu'uw ni jún i xeklek, ka met'a' max a pat'alil palat ti wat'bom káw ebtsolom.</li> </ul>

source: <ul> <li>The site could be temporarily unavailable or too busy. Try again in a few moments.</li> <li>If you are unable to load any pages, check your mobile device’s data or Wi-Fi connection.</li> </ul>
hus: <ul> <li>An kwene' xeklekchik walám tekedh eyadh (walám yab xant'oj). Ka exa' ka tsa'biy talbél.</li> <li>Max yab u awil ka tsu'uw ni jún i xeklek, ka met'a' max a pat'alil palat ti wat'bom káw ebtsolom.</li> </ul>

source: <ul> <li>This could be a problem with the server’s configuration, or it could be someone trying to impersonate the server.</li> <li>If you have connected to this server successfully in the past, the error may be temporary, and you can try again later.</li> </ul>
hus: <ul> <li>Axe' walál pel kom odhenek an pat'ál ju'taj dheyach an xeklek, o walál jita' in exál kin tajá' abal pel an pat'ál.</li> <li>Max a ejtomal kit otsits al axé' xi patál, walám odhenek po ne'ets ka ts'ejkaj, ka exa' kit otsits talbél.</li> </ul>

source: <ul> <li>This problem can sometimes be caused by disabling or refusing to accept cookies.</li> </ul>
hus: <ul> <li>Axe' xi kidhabtaláb pel kom a kuba' o kom yab a bats'uw an cookies.</li> </ul>

source: <ul> <li>Web addresses are usually written like <strong>http://www.example.com/</strong></li> <li>Make sure that you’re using forward slashes (i.e. <strong>/</strong>).</li> </ul>
hus: <ul> <li>Abal ka ela' an xeklek kwa'al ka dhucha' <strong>http://www.example.com/</strong></li> <li>Ka meta' abal a eyendhal an tsakam pelat te' (ejtíl <strong>/</strong>).</li> </ul>

source: <ul> <li>You might need to install other software to open this address.</li> </ul>
hus: <ul> <li>Walám in yejendhal ka punuw pil i eyendhanél abal ka japiy.</li> </ul>

source: Unable to connect
hus: Yab u awil ka pala'

source: Unlock %1$s
hus: Ka japiy %1$s

source: URL already exists
hus: An URL wa'tits

source: URL Autocomplete
hus: Ka kwetém kidhban an URL

source: URL copied
hus: URL k'ot'bidh

source: URL to add
hus: URL axi ne'ets ka punuw

source: Used to collect, analyze and measure activities like tapping and scrolling
hus: Eynal abal kin tamkuy, kin met'a' ani kin lejbay an t'ajbiláb, ejtil ka ni'a' ani ka tadhiy

source: Use fingerprint to unlock app
hus: Ka eyendha' in t'iplabil a ch'uchub abal ka japiy a eyextal

source: Username
hus: In bij an eyendhom

source: Verified by: %1$s
hus: Met'adh k'al: %1$s

source: Web Content
hus: Xi in kwa'al an xeklek

source: Website loaded
hus: Tejwa'its patal an xeklek

source: We can’t load this page for some reason.
hus: Yab i ejtowal ki pa'ba' an xeklek.

source: What's New
hus: Axi it

source: Would you like to turn on search suggestions?
hus: ¿A le' ka lek'wtsiy an eyendhanél axi ti uchál jant'o ka aliy?

source: Yes
hus: Aníts

source: You are not granted any rights or licenses to the trademarks of the Mozilla Foundation or any party, including the Mozilla, Firefox or %1$s names or logos. Additional information may be found <a href="%2$s">here</a>.
hus: Yab u pidhnal i walkadhtaláb in bij Fundación Mozilla, jun pejach in k'al, in bij ani an walekláb Mozilla, Firefox ani %1$s. U awil ka ela' axe' tin kwentaj <a href="%2$s"> te' </a>.

source: You can leave %1$s to open this link in %2$s.
hus: U awil kit kalej ti %1$s abal ka japiy ti %2$s.

source: Your browsing history has been erased.
hus: Pakuwatits an dhuchlab xi in olnál jant'oj a aliyamal.

source: Your fingerprint can unlock %1$s if a URL is already opened in the app. Stealth will be turned on.
hus: A ch'uchub ne'ets kin japiy %1$s max an URL k'wajatits japidh ta eyendhanélil. Ne'ets ka japin an tsinat alix.

source: Your Rights
hus: A awiltal

source: Your search, your way
hus: A alimtal jant'in tat a le'

source: In-context localization
hus: Wilk'ix jant'ini' u eyendháb

source: In-context localization in Pontoon
hus: Wilk'ix jant'ini' u eyendháb ti Pontoon

source: In place.
hus: Jant'in eynal

source: Join us
hus: Kit tamkun k'al wawá'

source: Localize the web.
hus: Ka wilk'iyat an web.

source: Pontoon by Mozilla
hus: Pontoon ts'ejkadh k'al Mozilla

source: Tell Me More
hus: U leyej ku exla'

source: What is in-context localization?
hus: ¿Jant'ini' jats jnat'in u eynal?

source: Continue with this browser
hus: yab kit kalej al axi navegador

source: Copied!
hus: Letsbadh...

source: Copy link
hus: ka k'ot'biy an enlace

source: Copy the link to open in another browser
hus: Ka k'ot'biy an enlace abal ka japiy al pil i navegador

source: Copy the link to share your file:
hus: Ka k'ot'biy an enlace abal ka ejtow ka buk'uw a t'ojlabil:
